# RebarInternalMultiplanarEndConnector Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarInternalMultiplanarEndConnector Property
ParameterTypeId Class See Also
---
"INTERNAL: Multiplanar End Connector"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarInternalMultiplanarEndConnector { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarInternalMultiplanarEndConnector As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarInternalMultiplanarEndConnector {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace